; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=23, remove_proportion=0.2, bases=4, instance_id=11, output=./training, seed=52

(define (problem warehouse-11)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 - box
        base1 base2 base3 base4 - base
    )
    (:init
        (to-remove box2)
        (to-remove box9)
        (to-remove box16)
        (to-remove box17)
        (clear box11)
        (on box11 box10)
        (on box10 box16)
        (on box16 box3)
        (on box3 box14)
        (on-base box14 base1)
        (clear box5)
        (on box5 box20)
        (on box20 box18)
        (on box18 box7)
        (on box7 box15)
        (on box15 box17)
        (on box17 box4)
        (on-base box4 base2)
        (clear box21)
        (on box21 box8)
        (on box8 box1)
        (on-base box1 base3)
        (clear box19)
        (on box19 box12)
        (on box12 box13)
        (on box13 box6)
        (on box6 box22)
        (on box22 box2)
        (on box2 box23)
        (on box23 box9)
        (on-base box9 base4)
    )
    (:goal (and 
        (removed box2)
        (removed box9)
        (removed box16)
        (removed box17)
    ))
)

; plan
1. (move box11 box10 box21)
   deleted: (clear box21) (on box11 box10)
   added: (on box11 box21) (clear box10)
   goals met: 0 of 4
2. (move box10 box16 box11)
   deleted: (clear box11) (on box10 box16)
   added: (on box10 box11) (clear box16)
   goals met: 0 of 4
3. (move box19 box12 box10)
   deleted: (clear box10) (on box19 box12)
   added: (on box19 box10) (clear box12)
   goals met: 0 of 4
4. (remove box16 box3)
   deleted: (on box16 box3) (clear box16)
   added: (removed box16) (clear box3)
   goals met: 1 of 4
5. (move box12 box13 box19)
   deleted: (clear box19) (on box12 box13)
   added: (on box12 box19) (clear box13)
   goals met: 1 of 4
6. (move box13 box6 box12)
   deleted: (clear box12) (on box13 box6)
   added: (on box13 box12) (clear box6)
   goals met: 1 of 4
7. (move box5 box20 box13)
   deleted: (clear box13) (on box5 box20)
   added: (on box5 box13) (clear box20)
   goals met: 1 of 4
8. (move box20 box18 box3)
   deleted: (clear box3) (on box20 box18)
   added: (on box20 box3) (clear box18)
   goals met: 1 of 4
9. (move box18 box7 box20)
   deleted: (clear box20) (on box18 box7)
   added: (on box18 box20) (clear box7)
   goals met: 1 of 4
10. (move box6 box22 box18)
   deleted: (clear box18) (on box6 box22)
   added: (on box6 box18) (clear box22)
   goals met: 1 of 4
11. (move box22 box2 box5)
   deleted: (clear box5) (on box22 box2)
   added: (on box22 box5) (clear box2)
   goals met: 1 of 4
12. (remove box2 box23)
   deleted: (on box2 box23) (clear box2)
   added: (removed box2) (clear box23)
   goals met: 2 of 4
13. (move box23 box9 box22)
   deleted: (clear box22) (on box23 box9)
   added: (on box23 box22) (clear box9)
   goals met: 2 of 4
14. (move box7 box15 box23)
   deleted: (clear box23) (on box7 box15)
   added: (on box7 box23) (clear box15)
   goals met: 2 of 4
15. (move box15 box17 box6)
   deleted: (clear box6) (on box15 box17)
   added: (on box15 box6) (clear box17)
   goals met: 2 of 4
16. (remove box17 box4)
   deleted: (on box17 box4) (clear box17)
   added: (removed box17) (clear box4)
   goals met: 3 of 4
17. (remove-from-base box9 base4)
   deleted: (on-base box9 base4) (clear box9)
   added: (removed box9) (clear-base base4)
   goals met: 4 of 4
